{
  "version": "v7-actionable",
  "updated": "2026-02-22",
  "stats": {
    "total_scripts": 15,
    "type": "Actionable scripts based on top reels from all 12 creators",
    "source": "Top 5 per creator → rewritten as actionable, natural scripts"
  },
  "scripts": [
    {
      "id": "sell-ai-agents-40k",
      "title": "How to sell AI agents for $40K/month",
      "status": "draft",
      "competitor_style": "@albert.olgaard — 1.28M views",
      "hooks": [
        "There's a service you can sell right now for 10 to 40 thousand dollars a month. And most people have no idea it exists.",
        "I know people making 40K a month selling something that takes two hours to set up. Let me show you exactly how.",
        "The easiest high-ticket service to sell in 2026 is AI agents. Here's the step-by-step."
      ],
      "screen_captions": [
        "$40K/MONTH SERVICE",
        "AI AGENTS = MONEY",
        "STEP BY STEP GUIDE"
      ],
      "full_script": "There's a service you can sell right now for 10 to 40 thousand dollars a month. And most people have no idea it exists.\n\n[SHOW: Screen recording of an AI agent handling emails, scheduling, CRM updates]\n\nIt's called AI agent setup. Basically, you take a tool like OpenClaw or Claude Code, you configure it for a business owner, and you charge them monthly to maintain it.\n\nHere's exactly how you do it. Step one. Find a business owner who's drowning in admin work. Think real estate agents, e-commerce brands, marketing agencies. They're everywhere.\n\n[SHOW: Quick scroll through LinkedIn/Instagram showing business owners complaining about workload]\n\nStep two. You set up an AI agent that handles their repetitive tasks. Email responses, lead qualification, appointment scheduling, data entry. This takes you maybe two to four hours.\n\nStep three. You charge them 2 to 5 thousand for the setup, then 1 to 3 thousand per month to manage it. They're saving 20 hours a week. That's easily worth 3K to them.\n\n[SHOW: Simple pricing table on screen — Setup: $2-5K, Monthly: $1-3K]\n\nThe crazy part? Once you've done it for one client in a niche, you can literally copy the same setup for the next client in 30 minutes. Same templates, same workflows, just different login credentials.\n\nI'm doing this right now in Norway and the demand is insane because most businesses here haven't even heard of AI agents yet. If you want the full breakdown of how to find clients and close them, drop a comment.",
      "platform": "IG",
      "notes": "Based on albert.olgaard's 1.28M view reel. Actionable — actual steps, not just hype."
    },
    {
      "id": "day-experiment-ai-business",
      "title": "Day 1: I gave AI full control of my business",
      "status": "draft",
      "competitor_style": "@buildwithcody — 827K views (Day 2), 231K views (Day 1)",
      "hooks": [
        "Can an AI agent actually run a business and make real money? I'm about to find out.",
        "Everyone says AI can replace your job. So I'm giving it mine. Day one starts now.",
        "I just gave an AI agent access to my entire business. My CRM, my emails, my ad accounts. Let's see what happens."
      ],
      "screen_captions": [
        "AI RUNS MY BUSINESS",
        "DAY 1 — FULL ACCESS",
        "WILL IT MAKE MONEY?"
      ],
      "full_script": "Can an AI agent actually run a business and make real money? I'm about to find out.\n\n[SHOW: Your Mac Mini setup with OpenClaw running, Telegram notifications]\n\nSo here's what I did. I gave my AI agent full access to everything. My CRM with all my client data. My email inbox. My ad accounts. My calendar. Everything.\n\nThe rules are simple. For the next seven days, the AI handles everything that doesn't require my face on a camera. Client emails, lead follow-ups, ad monitoring, competitor research, scheduling.\n\n[SHOW: Screenshot of the AI's first actions — emails sent, leads scraped, calendar updated]\n\nDay one results. It sent 12 follow-up emails to leads that I'd been ignoring for two weeks. It flagged one ad campaign that was overspending by 40 percent and paused it. And it booked two discovery calls with potential clients.\n\nBut here's the thing nobody talks about. It also sent one email that was completely wrong. Like, it recommended a service we don't even offer. I caught it, fixed it, moved on.\n\nThat's the reality. It's not perfect. But it did more in 8 hours than I would've done in three days. Follow for day two because I actually went to sleep and I'm curious what it did overnight.",
      "platform": "IG",
      "notes": "Series format. Cody's Day X gets 200K-800K per episode. KEY: be honest about failures."
    },
    {
      "id": "ai-agent-setup-3-steps",
      "title": "Set up an AI agent that works 24/7 in 3 steps",
      "status": "draft",
      "competitor_style": "@baroobi — 248K views",
      "hooks": [
        "Stop paying a virtual assistant. Set up an AI agent that works 24/7 for less than a dollar a day. Here's how.",
        "Three steps to set up an AI assistant that never sleeps, never complains, and costs almost nothing.",
        "I replaced a $2000 per month VA with an AI that costs me 80 cents a day. Let me show you the exact setup."
      ],
      "screen_captions": [
        "REPLACE YOUR VA",
        "3 STEPS — AI AGENT",
        "$0.80/DAY ASSISTANT"
      ],
      "full_script": "I replaced a 2000 dollar per month virtual assistant with an AI that costs me 80 cents a day. Let me show you the exact setup.\n\n[SHOW: Terminal with OpenClaw running]\n\nStep one. Get a Mac Mini or any computer that can stay on 24/7. Doesn't need to be fancy. The base model works fine. Install OpenClaw on it. Takes about 10 minutes.\n\n[SHOW: OpenClaw install command in terminal]\n\nStep two. Connect it to your tools. I connected mine to Telegram so I can message it like a real assistant. Then I hooked it up to my Google Calendar, my email, and my CRM. Each connection takes about 5 minutes.\n\n[SHOW: Quick montage of connecting Telegram, Calendar, CRM]\n\nStep three. Give it a job description. Seriously. Just like you would for a human assistant. I told mine — check my emails every hour, flag anything urgent, draft responses for the rest. Monitor my ad campaigns and tell me if anything drops below target. And every morning, send me a summary of what happened overnight.\n\n[SHOW: The actual morning summary message on Telegram]\n\nThat's it. Three steps. It now handles about 70 percent of what my VA used to do. The other 30 percent still needs a human, and that's fine. But 70 percent automated means I got 3 hours back every single day.\n\nIf you want the exact prompts I use, follow and I'll post them this week.",
      "platform": "IG",
      "notes": "Actionable tutorial. Baroobi's 'how to fix in 3 steps' format but for setup, not security."
    },
    {
      "id": "5-automations-any-business",
      "title": "5 things AI can automate in ANY business today",
      "status": "draft",
      "competitor_style": "@mattganzak — 96K views",
      "hooks": [
        "Five things you're still doing manually that AI can handle right now. Not in five years. Right now.",
        "If you run a business and you're doing any of these five things manually, you're wasting hours every week.",
        "Here are five automations I set up for clients that save them 20 plus hours a week. Each one takes under an hour."
      ],
      "screen_captions": [
        "5 AI AUTOMATIONS",
        "STOP DOING THIS MANUALLY",
        "SAVE 20 HOURS/WEEK"
      ],
      "full_script": "Five things you're still doing manually that AI can handle right now.\n\nNumber one. Email responses. If you're spending 45 minutes every morning going through emails, you're doing it wrong. Set up an AI that reads every email, drafts a response, and sends you only the ones that actually need your brain. Everything else gets handled automatically.\n\n[SHOW: Before/after — inbox with 47 unread vs AI-sorted inbox with 5 flagged]\n\nNumber two. Lead follow-up. You know those leads that come in at 2am and you forget to respond until the next afternoon? Your AI responds in 30 seconds. Every time. I set this up for a real estate agent and his booking rate went from 15 percent to 40 percent just because he was responding faster.\n\n[SHOW: Timestamp comparison — lead comes in 2:14am, AI responds 2:14am]\n\nNumber three. Social media monitoring. Instead of manually checking what your competitors are posting, your AI scrapes their content every day and sends you a summary. What hooks they're using, what's getting engagement, what topics are trending.\n\n[SHOW: A competitor analysis report — hooks, views, engagement rates]\n\nNumber four. Meeting notes and action items. Record your calls, AI transcribes them, pulls out every action item, and adds them to your project management tool. No more forgetting what you promised on a call.\n\n[SHOW: Fathom/transcript → Asana task board]\n\nNumber five. Invoice and payment reminders. Your AI checks who hasn't paid, sends a polite reminder, and escalates if they don't respond in 48 hours. I had one client recover 12 thousand dollars in overdue invoices the first week.\n\n[SHOW: Payment reminder email + \"$12K recovered\" text]\n\nEvery single one of these takes less than an hour to set up. Which one are you doing manually right now?",
      "platform": "IG",
      "notes": "Pure value. Each automation is specific and actionable. Mattganzak walkthrough style."
    },
    {
      "id": "hormozi-framework",
      "title": "The $100M framework that changed how I sell",
      "status": "draft",
      "competitor_style": "@buildwithcody — 65K views + @albert.olgaard — 44K views",
      "hooks": [
        "Alex Hormozi has a framework for making offers so good that people feel stupid saying no. Here's how I use it.",
        "I read a book that completely changed how I price my services. And no, it's not what you think.",
        "The reason most people can't sell AI services is because their offer sucks. Here's the fix."
      ],
      "screen_captions": [
        "OFFERS THEY CAN'T REFUSE",
        "THE $100M FRAMEWORK",
        "FIX YOUR OFFER"
      ],
      "full_script": "Alex Hormozi has a framework for making offers so good that people feel stupid saying no. Let me show you how I actually use it.\n\nThe formula is simple. Value equals dream outcome times perceived likelihood of success divided by time delay times effort and sacrifice.\n\n[SHOW: The formula written on screen cleanly]\n\nSounds complicated. It's not. Here's what it means in practice.\n\nWhen I sell AI automation to a business owner, I don't say 'I'll set up an AI agent for you.' That's boring. Nobody gets excited about that.\n\nInstead I say 'I'm going to save you 20 hours a week, get your leads responded to in under 60 seconds instead of 6 hours, and the whole thing is set up in 48 hours with zero effort from your team.'\n\n[SHOW: Side by side — boring offer vs Hormozi-style offer]\n\nSame exact service. But now the dream outcome is clear — save 20 hours. The likelihood feels high because I mentioned the specific 60-second response time. The time delay is tiny — 48 hours. And the effort is zero.\n\nThat one reframe took my close rate from like 20 percent to over 50 percent. I went from chasing clients to clients chasing me.\n\nThe book is called $100M Offers. It's free as an audiobook. If you sell anything — AI services, marketing, freelancing — this framework will change your revenue overnight.",
      "platform": "IG",
      "notes": "Book recommendation + actual application. Sounds scammy format from Cody but with real tactical value."
    },
    {
      "id": "one-person-ai-business",
      "title": "How to run a one-person AI business making 6 figures",
      "status": "draft",
      "competitor_style": "@simonbeard — 44K views",
      "hooks": [
        "One person. No employees. No office. Making six figures selling AI services. Here's the exact model.",
        "You don't need a team to run an AI business. You need three tools and one skill. Let me explain.",
        "The easiest business model I've ever seen is selling AI automation. One person can do 10K a month within 90 days."
      ],
      "screen_captions": [
        "ONE PERSON. SIX FIGURES.",
        "NO TEAM NEEDED",
        "THE AI BUSINESS MODEL"
      ],
      "full_script": "One person. No employees. No office. Making six figures selling AI services. Here me out because this is the simplest business model I've seen.\n\nYou need three things. A laptop. An AI tool like OpenClaw or Claude Code. And the ability to talk to business owners.\n\n[SHOW: Simple diagram — laptop + AI tool + communication = money]\n\nHere's the model. You find small businesses that are drowning in admin work. Dentists, real estate agents, marketing agencies, e-commerce stores. You set up AI automations that handle their repetitive tasks. You charge them monthly.\n\nThe math works like this. Ten clients paying you 2000 a month is 20K per month. 240K per year. And once you set up a client, the maintenance takes maybe 2 hours per month per client.\n\n[SHOW: Calculator — 10 clients × $2K = $20K/month = $240K/year]\n\nThat's 20 hours a month to maintain a 240K business. The rest of your time goes into finding new clients and improving your systems.\n\nBut here's the part nobody talks about. The first three clients are the hardest. After that, your existing clients start referring you. I got my fourth and fifth client from referrals without spending a single dollar on marketing.\n\n[SHOW: Simple referral chain graphic]\n\nThe skill stack you need. Basic AI tool setup — you can learn this in a weekend. Basic sales — just have honest conversations about their problems. And basic project management — deliver what you promise.\n\nThat's it. No coding. No fancy website. No team. Just solve problems with AI and charge for it.",
      "platform": "IG",
      "notes": "Simon Beard's 'one person revolution' format but specifically for AI services."
    },
    {
      "id": "automate-meta-ads",
      "title": "How to monitor Meta Ads with AI (save 3 hours/day)",
      "status": "draft",
      "competitor_style": "@noevarner.ai — 256K views",
      "hooks": [
        "Stop manually checking your Meta Ads dashboard. Set up AI monitoring in 60 seconds and save 3 hours every day.",
        "If you're running Meta Ads and you're still checking them manually, you're leaving money on the table. Here's the fix.",
        "I connected AI to my Meta Ad account and it caught a problem at 3am that would've cost me 500 dollars. Here's how."
      ],
      "screen_captions": [
        "META ADS + AI",
        "SAVE 3 HOURS/DAY",
        "CAUGHT $500 MISTAKE AT 3AM"
      ],
      "full_script": "I connected AI to my Meta Ad account and it caught a problem at 3am that would've cost me 500 dollars by morning.\n\n[SHOW: Telegram notification at 3:14am — 'Alert: Campaign X CPA spiked to $47, pausing ad set']\n\nHere's the setup. Go to developers.facebook.com. Create an app. Takes 2 minutes. Give it ads_read and ads_management permissions. Copy your access token.\n\n[SHOW: Facebook Developers dashboard, highlight the token]\n\nDrop that token into your AI agent config. Now tell it — monitor all active campaigns every 30 minutes. If CPA goes above my target, pause the ad set and message me. If spend exceeds daily budget by 20 percent, alert me immediately.\n\n[SHOW: The actual prompt/config for the AI agent]\n\nThat's literally it. Your AI now watches your ads 24/7. It catches budget bleeds at 3am. It pauses underperformers before they waste money. And every morning it sends you a summary — which campaigns are profitable, which need attention, what your ROAS looks like.\n\n[SHOW: Morning summary — Campaign performance table with green/red indicators]\n\nI run ads for multiple clients. Before this, I was spending 3 hours a day just checking dashboards. Now I spend 15 minutes reviewing what the AI flagged. The rest runs on autopilot.\n\nIf you run ads for yourself or clients, this is the first automation you should set up. It literally pays for itself in the first week.",
      "platform": "IG",
      "notes": "Noe Varner's ultra-actionable tutorial style. 256K views on his Meta Ads + Claude reel."
    },
    {
      "id": "ai-overnight-mvp",
      "title": "I built an entire app overnight with AI for 3 cents",
      "status": "draft",
      "competitor_style": "@mattganzak — 70K views",
      "hooks": [
        "I went to sleep. Woke up. And my AI had built an entire working app. Total cost — 3 cents.",
        "People are paying developers 50K to build apps. I paid 3 cents and got mine overnight. Here's how.",
        "The most expensive part of building an app used to be hiring a developer. Now it costs 3 cents and 8 hours of sleep."
      ],
      "screen_captions": [
        "$0.03 APP 💰",
        "BUILT WHILE I SLEPT",
        "AI DEVELOPER = 3 CENTS"
      ],
      "full_script": "I went to sleep last night. Woke up this morning. And my AI had built an entire working app. Total cost — 3 cents.\n\n[SHOW: Terminal showing the AI coding session — files created, tests passing]\n\nHere's what I did. Before bed, I gave my AI a detailed prompt. Build me a web app that takes a list of Instagram usernames, scrapes their top performing content, and displays it in a dashboard sorted by engagement.\n\n[SHOW: The actual prompt you gave it]\n\nI specified the tech stack. React frontend, Python backend, clean UI. Then I hit enter and went to sleep.\n\n[SHOW: Time-lapse or morning screenshot — 847 lines of code, 12 files created]\n\n8 hours later, I had a fully working app. 847 lines of code across 12 files. Frontend, backend, API connections, all working. I opened it up, typed in some usernames, and it worked on the first try.\n\n[SHOW: The actual working app in browser — dashboard with real data]\n\nNow, was it perfect? No. I spent about 30 minutes tweaking the design and fixing one API endpoint. But 30 minutes of polish versus building the whole thing from scratch? That's insane.\n\nThe 3 cents was the actual API cost for the AI tokens it used overnight. Not a monthly subscription. Not a developer's hourly rate. Three cents.\n\nIf you have an app idea you've been sitting on, stop waiting. Give it to an AI tonight and wake up to a working prototype tomorrow.",
      "platform": "IG",
      "notes": "Mattganzak's overnight build format. 70K views. Specific numbers sell it."
    },
    {
      "id": "competitor-research-5min",
      "title": "Spy on your competitors' content in 5 minutes with AI",
      "status": "draft",
      "competitor_style": "@dubibuilds — 57K views",
      "hooks": [
        "I can tell you exactly what content your competitor posted this week, what got the most engagement, and what hooks they used. In 5 minutes.",
        "Stop guessing what content to make. Let AI analyze your competitors and tell you what actually works.",
        "Every week my AI sends me a report on exactly what my competitors are doing. Takes 5 minutes to set up. Never miss a move again."
      ],
      "screen_captions": [
        "SPY ON COMPETITORS",
        "5 MINUTE SETUP",
        "WEEKLY AUTO-REPORT"
      ],
      "full_script": "Every week my AI sends me a report on exactly what my competitors are doing. What they posted, what got engagement, what hooks they used, what flopped. And it takes zero effort because it runs automatically.\n\n[SHOW: The actual weekly report on screen — competitor names, posts, engagement numbers]\n\nHere's how to set this up. First, make a list of 5 to 10 competitors in your niche. Just their Instagram handles.\n\n[SHOW: Simple list of competitor handles]\n\nSecond, connect an Instagram scraping API. I use one that costs basically nothing. It pulls their latest posts, reels, engagement numbers, captions — everything.\n\n[SHOW: API response with real data]\n\nThird, tell your AI to analyze the data every Sunday night. Find the top 3 posts by engagement. Pull out the hooks they used. Identify patterns — what topics are getting traction, what format works best, what time they're posting.\n\n[SHOW: Analysis output — top hooks, best formats, trending topics]\n\nEvery Monday morning I wake up to a message that says — here are your competitors' best posts this week, here are the hooks that worked, and here are 5 content ideas based on what's trending in your niche.\n\n[SHOW: Monday morning Telegram message with the full brief]\n\nI used to spend 2 hours every week manually scrolling through competitors' profiles taking screenshots. Now it happens while I sleep. This is the exact system that Jason Cooperson describes for content research — but fully automated.\n\nWant me to show you the exact setup? Follow and I'll break it down step by step.",
      "platform": "IG",
      "notes": "Jason Cooperson's content research system as a tutorial. Actionable + saves time."
    },
    {
      "id": "ai-client-onboarding",
      "title": "Client onboarding in 10 minutes instead of 3 hours",
      "status": "draft",
      "competitor_style": "@matthewberman_ai — 324K views",
      "hooks": [
        "New client signs up. 10 minutes later, everything is set up. Welcome email, project board, kickoff call scheduled. All automatic.",
        "I used to spend 3 hours onboarding each new client. Now it takes 10 minutes because AI handles everything.",
        "The fastest way to impress a new client is speed. My AI onboards them in 10 minutes. Here's how."
      ],
      "screen_captions": [
        "10 MIN ONBOARDING",
        "FULLY AUTOMATED",
        "IMPRESS NEW CLIENTS"
      ],
      "full_script": "New client signs up. Within 10 minutes — welcome email sent, project board created, kickoff call scheduled, questionnaire delivered. All automatic. Zero work from me.\n\n[SHOW: Timeline graphic — Client signs → 10 min → everything done]\n\nHere's how I set this up. When a new client pays, my AI gets triggered. First thing it does — sends a personalized welcome email. Not a template. It uses the client's name, their business type, and references the specific problems we discussed on the sales call.\n\n[SHOW: Actual welcome email — personalized, professional]\n\nSecond, it creates a project board in Asana. Pre-loaded with every task for the first 30 days. Week 1 tasks, week 2 tasks, milestones, deadlines. All customized based on which service package they bought.\n\n[SHOW: Asana board with tasks already populated]\n\nThird, it checks my calendar, finds the first available 30-minute slot, and sends the client a booking link for the kickoff call. No back and forth. No 'when works for you' emails.\n\n[SHOW: Calendar booking link being generated and sent]\n\nFourth, it sends a quick questionnaire to gather the info we need before the kickoff. Login credentials, brand guidelines, current tools they use.\n\n[SHOW: Questionnaire form]\n\nThe client's experience — they pay, and within 10 minutes they've gotten a welcome email, a project roadmap, a scheduled call, and a questionnaire. They feel like they hired a team of 5 people. It's actually one person and an AI.\n\nFirst impressions matter. This is how you make clients think they made the best decision of their life.",
      "platform": "IG",
      "notes": "From Albert's agency list (#8 Client Onboarding). Matthew Berman's 'AI doing real work' style."
    },
    {
      "id": "scrape-leads-free",
      "title": "How I find 100 qualified leads in 10 minutes for free",
      "status": "draft",
      "competitor_style": "@noevarner.ai — 170K views",
      "hooks": [
        "Finding leads is not hard. Here's how I get 100 qualified leads in 10 minutes without paying for a database.",
        "Stop buying lead lists. Your AI can find better leads for free. Let me show you.",
        "I just found 100 business owners who need AI automation. Took me 10 minutes. Cost me nothing. Here's how."
      ],
      "screen_captions": [
        "100 LEADS. 10 MINUTES.",
        "FREE LEAD GENERATION",
        "STOP BUYING LISTS"
      ],
      "full_script": "I just found 100 business owners who need AI automation in the next 10 minutes. Didn't pay for a lead database. Didn't use LinkedIn Sales Navigator. Just my AI and a simple trick.\n\n[SHOW: Terminal/screen with the AI running]\n\nHere's the method. Google Maps has every local business listed with their website, phone number, and often their email. My AI scrapes a specific type of business in a specific area.\n\nToday I searched for marketing agencies in Oslo. Got 200 results in about 3 minutes.\n\n[SHOW: Google Maps results for 'marketing agencies Oslo']\n\nBut here's where it gets good. My AI then visits each website and checks — do they mention AI anywhere? Do they have a chatbot? Are they still using manual processes that are obvious from their site?\n\nThe ones that don't mention AI at all — those are the leads. Because they clearly haven't adopted it yet, which means they need help.\n\n[SHOW: Spreadsheet with leads — business name, website, email, 'AI readiness score']\n\nOut of 200 agencies, 147 had zero AI presence on their site. Those are warm leads. They're already in a competitive market, they know they need to modernize, they just haven't found the right person to help them.\n\nI filtered for the ones with more than 10 employees — that means they have budget. That gave me 100 qualified leads with emails and phone numbers. Total cost — zero. Total time — 10 minutes.\n\nThe leads are only valuable if you follow up. So my AI also drafts a personalized outreach message for each one based on what their website says. That's a topic for another video.",
      "platform": "IG",
      "notes": "Lead gen tutorial. Noe Varner actionable style. Directly useful for anyone selling services."
    },
    {
      "id": "started-at-17-failed",
      "title": "I failed at my first business at 17. Best thing that happened to me.",
      "status": "draft",
      "competitor_style": "@simonbeard — 67K views (credibility intro)",
      "hooks": [
        "I started my first company at 17. Shower filters. Selling to Sweden. It completely failed. And it was the best thing that ever happened to me.",
        "My first business failed in 6 months. I was 17 and I thought I was done. Turns out that failure built everything I have now.",
        "At 17 I tried to sell shower filters to Sweden. Yes, really. Here's what that failure taught me about building a real business."
      ],
      "screen_captions": [
        "FAILED AT 17",
        "SHOWER FILTERS TO SWEDEN 😂",
        "BEST FAILURE EVER"
      ],
      "full_script": "I started my first company at 17. Shower filters. Selling to Sweden. And it completely failed.\n\nI spent weeks making the website look perfect. I designed the packaging. I set up the supply chain. I was so proud of this product. There was just one tiny problem.\n\n[SHOW: Old Noropti website or product photos]\n\nI forgot to check if anyone actually wanted to buy it. Classic. I was so focused on making everything look professional that I never talked to a single customer first.\n\nSix months in, barely any sales, burning money on inventory. I had to shut it down.\n\nBut here's what that failure taught me. Three things.\n\n[SHOW: '3 LESSONS' text on screen]\n\nOne. Speed beats perfection. I spent weeks on a website that nobody visited. Should've spent that time talking to customers. The ugly landing page that's live beats the beautiful one that's still in Figma.\n\nTwo. Solve a real problem first. Don't fall in love with your product. Fall in love with the problem. If I had talked to 10 people first, I would've known the demand wasn't there.\n\nThree. Leverage. I was doing everything manually. Shipping, customer support, marketing. One person, 16 hours a day. Then I discovered AI automation. And I thought — wait, I can build this for other businesses and charge them for it.\n\n[SHOW: Current AI consulting business — dashboard, clients, revenue]\n\nThat's exactly what I did. I'm 18 now. I run an AI automation consulting company in Norway. Real clients. Growing fast. And every single lesson came from that first failure.\n\nIf you're young and thinking about starting something — just start. The lessons are worth more than the business.",
      "platform": "IG",
      "notes": "Albert's real story. Simon Beard credibility style. Pin this."
    },
    {
      "id": "3-mistakes-ai-agents",
      "title": "3 mistakes everyone makes building AI agents",
      "status": "draft",
      "competitor_style": "@baroobi — 61K views + @angus.sewell — 22K views",
      "hooks": [
        "Everyone's building AI agents right now. And almost everyone is making the same three mistakes. Here's how to avoid them.",
        "I've set up AI agents for 10 plus clients. These are the three mistakes I see every single time.",
        "Your AI agent sucks and it's probably because of one of these three things. Let me save you a week of debugging."
      ],
      "screen_captions": [
        "3 MISTAKES ❌",
        "WHY YOUR AI SUCKS",
        "FIX THESE NOW"
      ],
      "full_script": "I've set up AI agents for over 10 clients. And almost every single one makes the same three mistakes. Let me save you a week of debugging.\n\nMistake number one. No guardrails. People give their AI agent full access to everything and say go. That's how you get an AI sending emails to your biggest client at 3am saying something completely insane. Always set limits. What it can send without approval, what needs your sign-off, what it should never touch.\n\n[SHOW: Example config — approved actions vs needs-approval vs blocked]\n\nMistake number two. No memory system. If your AI doesn't remember what happened yesterday, it's going to repeat the same mistakes every single day. You need a memory file that it reads every morning. Who are the clients. What's the current status. What happened yesterday. Without this, your AI has amnesia.\n\n[SHOW: Example MEMORY.md file — client list, current tasks, yesterday's log]\n\nMistake number three. Too many tasks at once. People try to automate everything on day one. Email, CRM, ads, content, scheduling, invoicing — all at the same time. It breaks. Every time. Start with one automation. Get it working perfectly. Then add the next one.\n\n[SHOW: Week 1: email only → Week 2: add CRM → Week 3: add monitoring → etc.]\n\nThe right approach is boring. One thing at a time. Test it. Fix the edge cases. Then scale. The people who do this have agents that actually work. The people who try to do everything at once have agents that are broken by day three.\n\nWhich mistake are you making? Drop it in the comments.",
      "platform": "IG",
      "notes": "Actionable debugging advice. Combines baroobi's rant energy with actual fixes."
    },
    {
      "id": "chatgpt-wrong",
      "title": "You're using ChatGPT completely wrong",
      "status": "draft",
      "competitor_style": "@dubibuilds — 12K views + @angus.sewell — 109K views",
      "hooks": [
        "You're using ChatGPT like a Google search and that's why your results suck. Here's how the pros actually use it.",
        "95 percent of people use AI wrong. They type one sentence and expect magic. Here's what to do instead.",
        "The difference between getting garbage from AI and getting gold is three prompting techniques. Takes 60 seconds to learn."
      ],
      "screen_captions": [
        "YOU'RE DOING IT WRONG",
        "STOP GOOGLING WITH AI",
        "3 PRO TECHNIQUES"
      ],
      "full_script": "95 percent of people type something like 'write me a marketing email' into ChatGPT and then complain that AI is overhyped. That's like buying a Ferrari and only driving it in first gear.\n\nHere are three techniques that will completely change your results.\n\n[SHOW: ChatGPT interface]\n\nTechnique one. Give it a role. Don't just say 'write me an email.' Say 'you are a direct response copywriter with 15 years of experience selling B2B services. Write me a cold email to a marketing agency owner who doesn't know what AI agents are.' Night and day difference.\n\n[SHOW: Side by side — generic prompt result vs role-based prompt result]\n\nTechnique two. Give it context, then ask. Before you ask for the output, paste in your existing content, your brand voice, examples of emails you like. The more context it has, the less generic the output. I paste in my previous best emails and say 'match this tone and style.'\n\n[SHOW: Prompt with context pasted in → much better output]\n\nTechnique three. Iterate, don't accept. Never use the first response. Say 'make it shorter.' 'Make the hook more specific.' 'Remove the corporate language.' 'Add a real number.' Each iteration gets 10 times better.\n\n[SHOW: V1 → V2 → V3 of the same email, each one clearly better]\n\nThe people getting insane results from AI aren't smarter than you. They're just better at asking. These three techniques take 60 seconds to apply and they'll transform every single interaction you have with AI.",
      "platform": "IG",
      "notes": "Universal value — everyone uses ChatGPT. Angus's 'fired up about AI tools' energy."
    },
    {
      "id": "morning-routine-ai-ceo",
      "title": "My morning as an 18-year-old AI CEO",
      "status": "draft",
      "competitor_style": "@albert.olgaard — 287K followers (personal brand)",
      "hooks": [
        "6am. My AI already sent me a briefing of everything that happened overnight. Here's what my morning looks like.",
        "I'm 18 and I run an AI company. My morning routine is different from what you'd expect.",
        "My AI starts working at midnight. By the time I wake up, half my day is already done. Let me show you."
      ],
      "screen_captions": [
        "18-YEAR-OLD AI CEO",
        "MY AI STARTS AT MIDNIGHT",
        "MORNING ROUTINE 🌅"
      ],
      "full_script": "My AI starts working at midnight. By the time I wake up, half my day is already done.\n\n[SHOW: Phone screen — 6am, Telegram notifications from AI]\n\n6am. First thing I check — the overnight report from my AI. It tells me what happened while I was sleeping. Last night, it scraped 200 leads for a client project, responded to 3 email inquiries, and flagged one ad campaign that was overspending.\n\n[SHOW: Actual overnight summary message]\n\n6:15. Coffee. I review the leads it found. Most are good. I approve 180 out of 200. The other 20 were restaurants, which is outside our target market. Takes me 5 minutes.\n\n[SHOW: Quick scroll through lead list, approving/rejecting]\n\n6:30. I check the content brief my AI prepared. It analyzed my competitors' posts from yesterday, found 3 hooks that performed well, and drafted 2 script ideas based on trending topics. I pick one and start filming.\n\n[SHOW: Content brief on screen — competitor hooks, script draft]\n\n7:00. I film one reel. 90 seconds. The script was already written. I just read it naturally and add my own spin.\n\n7:15. Gym. By 8:30 I'm at my desk for the first real meeting. But the thing is — three hours of work was already done before I even opened my laptop.\n\n[SHOW: Summary card — 200 leads, 3 emails, 1 ad fix, 1 content brief, 1 reel filmed — before 8am]\n\nPeople ask me how I run a business at 18 without a team. This is how. My team is an AI that works while I sleep.",
      "platform": "IG",
      "notes": "Personal brand content. Shows the lifestyle + the system. Albert.olgaard style."
    }
  ]
}
